# Pandas

## 1. Series

In [1]:
data= [10,20,30,40,50]

In [2]:
# create series from list

In [3]:
import pandas as pd

In [5]:
series_from_list=pd.Series(data)
print(series_from_list)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [6]:
import numpy as np

In [8]:
numpy_array=np.array([1,2,3,4,5])

In [10]:
series_from_numpy=pd.Series(numpy_array)
series_from_numpy

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [11]:
# create custom Index

In [12]:
custom_index_series=pd.Series(data,index=['A','B','C','D','E'])
custom_index_series

A    10
B    20
C    30
D    40
E    50
dtype: int64

# Access the Series

In [13]:
custom_index_series['C']

np.int64(30)

In [14]:
custom_index_series[2]

C:\Users\rites\AppData\Local\Temp\ipykernel_24116\796444265.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  custom_index_series[2]

np.int64(30)

In [15]:
series_from_list

0    10
1    20
2    30
3    40
4    50
dtype: int64

# slicing

In [16]:
slicing_series=series_from_list[1:4]
slicing_series

1    20
2    30
3    40
dtype: int64

## DataFrame

In [17]:
# create a dataframe using dictionary

In [18]:
dict1 = {
    'Name' : ['ram','eva','shyam','mark'],
    'Age':[29,39,49,57]
}
dict1

{'Name': ['ram', 'eva', 'shyam', 'mark'], 'Age': [29, 39, 49, 57]}

In [19]:
df_from_dict = pd.DataFrame(dict1)

In [20]:
print(df_from_dict)

    Name  Age
0    ram   29
1    eva   39
2  shyam   49
3   mark   57

In [21]:
df_from_dict

    Name  Age
0    ram   29
1    eva   39
2  shyam   49
3   mark   57

In [22]:
# create data frame from list

In [24]:
data_list=[['Alice,29'],['Mark,39'],['Charlie','48']]
data_list

[['Alice,29'], ['Mark,39'], ['Charlie', '48']]

In [27]:
df_from_list=pd.DataFrame(data_list,columns=['Name','Age'])

In [28]:
df_from_list

       Name   Age
0  Alice,29  None
1   Mark,39  None
2   Charlie    48

In [29]:
# empty dataframe

In [30]:
emptydf=pd.DataFrame()

In [32]:
emptydf

Empty DataFrame
Columns: []
Index: []

In [33]:
# accessing_Indexing

In [34]:
df_from_dict

    Name  Age
0    ram   29
1    eva   39
2  shyam   49
3   mark   57

In [37]:
name_col=df_from_dict['Name']#single column
name_col # Series

0      ram
1      eva
2    shyam
3     mark
Name: Name, dtype: object

In [39]:
sb_df=df_from_dict[['Name','Age']]
sb_df

    Name  Age
0    ram   29
1    eva   39
2  shyam   49
3   mark   57

In [40]:
# filter row on condition

In [41]:
df_from_dict[df_from_dict['Age']>40]

    Name  Age
2  shyam   49
3   mark   57

In [44]:
cell_value=df_from_dict.at[0,'Name']
cell_value

'ram'

# Loading the file

# 1. CSV File

In [46]:
# raed file

In [47]:
data= pd.read_csv(r"C:\Users\rites\Downloads\customers-100.csv")

In [48]:
data

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
0,1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,2020-08-24,http://www.stephenson.com/
1,2,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,686-620-1820x944,vmata@colon.com,2021-04-23,http://www.hobbs.com/
2,3,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,+1-539-402-0259,(496)978-3969x58947,beckycarr@hogan.com,2020-03-25,http://www.lawrence.com/
3,4,5Cef8BFA16c5e3c,Linda,Olsen,"Dominguez, Mcmillan and Donovan",Bensonview,Dominican Republic,001-808-617-6467x12895,+1-813-324-8756,stanleyblackwell@benson.org,2020-06-02,http://www.good-lyons.com/
4,5,053d585Ab6b3159,Joanna,Bender,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,001-199-446-3860x3486,colinalvarado@miles.net,2021-04-17,https://goodwin-ingram.com/
...,...,...,...,...,...,...,...,...,...,...,...,...
95,96,cb8E23e48d22Eae,Karl,Greer,Carey LLC,East Richard,Guyana,(188)169-1674x58692,001-841-293-3519x614,hhart@jensen.com,2022-01-30,http://hayes-perez.com/
96,97,CeD220bdAaCfaDf,Lynn,Atkinson,"Ware, Burns and Oneal",New Bradview,Sri Lanka,+1-846-706-2218,605.413.3198,vkemp@ferrell.com,2021-07-10,https://novak-allison.com/
97,98,28CDbC0dFe4b1Db,Fred,Guerra,Schmitt-Jones,Ortegaland,Solomon Islands,+1-753-067-8419x7170,+1-632-666-7507x92121,swagner@kane.org,2021-09-18,https://www.ross.com/
98,99,c23d1D9EE8DEB0A,Yvonne,Farmer,Fitzgerald-Harrell,Lake Elijahview,Aruba,(530)311-9786,001-869-452-0943x12424,mccarthystephen@horn-green.biz,2021-08-11,http://watkins.info/
99,100,2354a0E336A91A1,Clarence,Haynes,"Le, Nash and Cross",Judymouth,Honduras,(753)813-6941,783.639.1472,colleen91@faulkner.biz,2020-03-11,http://www.hatfield-saunders.net/

In [65]:
data2= pd.read_excel(r"C:\Users\rites\Downloads\Hospitality.xlsx",index_col=0)
data2

                       Unnamed: 1            Unnamed: 2 Unnamed: 3  Unnamed: 4
NaN                           NaN                   NaN        NaN         NaN
Min of Avg Room Rate          NaN                     2        NaN         NaN
71.1                          NaN                   NaN        NaN         NaN
NaN                           NaN                   NaN        NaN         NaN
NaN                           NaN                   NaN        NaN         NaN
...                           ...                   ...        ...         ...
NaN                           NaN                   NaN        NaN         NaN
9                      Row Labels  Sum of Avg Room Rate        NaN         NaN
NaN                            No            3327649.92        NaN         NaN
NaN                           Yes             3299423.4        NaN         NaN
NaN                   Grand Total            6627073.32        NaN         NaN

[145 rows x 4 columns]

In [53]:
data2= pd.read_excel(r"C:\Users\rites\Downloads\Hospitality.xlsx",sheet_name='Hospitality')

In [54]:

data2

,Avg Room Rate,reservation_id,check_in_date,stay_duration,adults,children,room_type,special_requests_flag,booking_channel,reservation_status,advanced_booking,Property,Date,Rate Type
0,71.10,779087-Y5-9824-SA,4/15/2020,13,3,4,Single,Yes,Call Center,Completed,Yes,The Chord,4/15/2020,Weekday
1,71.10,984023-QO-5015-YG,2020-12-06 00:00:00,3,3,3,Single,No,Travel Agent,Completed,Yes,The Chord,2020-12-06 00:00:00,Weekday
2,172.38,518066-UQ-2315-FK,2/25/2020,11,4,2,Queen,No,Call Center,Completed,Yes,The Sankey,2/25/2020,Weekday
3,172.38,130339-H9-2116-KE,9/15/2020,11,4,1,Queen,No,Website,No-Show,Yes,The Sankey,9/15/2020,Weekday
4,199.00,961051-40-0956-EO,2020-05-01 00:00:00,14,2,4,Double,Yes,Walk-in,Completed,No,The Sankey,2020-05-01 00:00:00,Weekend
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
49995,177.45,248063-7J-6726-SQ,2020-06-06 00:00:00,6,1,4,King,Yes,Call Center,Completed,No,The Sankey,2020-06-06 00:00:00,Weekday
49996,100.98,988239-X6-3251-XO,2020-09-02 00:00:00,12,1,2,Queen,No,Website,Completed,No,The Chord,2020-09-02 00:00:00,Weekend
49997,208.95,644180-N3-2350-ZJ,2020-08-06 00:00:00,2,3,1,King,No,Phone App,Completed,Yes,The Sankey,2020-08-06 00:00:00,Weekend
49998,202.98,866690-J9-9283-PA,5/17/2020,3,2,2,Queen,No,Phone App,Completed,Yes,The Sankey,5/17/2020,Weekend
49999,80.58,074193-UW-0434-ZV,6/19/2020,11,3,1,Queen,No,Call Center,No-Show,Yes,The Chord,6/19/2020,Weekday

In [61]:
data2= pd.read_html('https://www.w3schools.com/html/html_tables.asp')[1]

In [59]:
data2

          Tag                                        Description
0     <table>                                    Defines a table
1        <th>                   Defines a header cell in a table
2        <tr>                           Defines a row in a table
3        <td>                          Defines a cell in a table
4   <caption>                            Defines a table caption
5  <colgroup>  Specifies a group of one or more columns in a ...
6       <col>  Specifies column properties for each column wi...
7     <thead>               Groups the header content in a table
8     <tbody>                 Groups the body content in a table
9     <tfoot>               Groups the footer content in a table